app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if params[:author_id]
      @post = Author.find(params[:author_id]).posts.find(params[:id])